# Semana 2 do Aceleradev DS Codenation

### Professor: Túlio Vieira de Souza  |  Tema: Manipulação de Dados e Análise Descritiva

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

como pedir __ajuda__ para descobrir o que os métodos fazem?
```python
pacote?
pacote.método?
```

In [2]:
pd.read_csv?

Para ilustrar o funcionamento do pacote __Pandas__, e até para nos acostumarmos à manipulação de dados, é necessário aprender mexer com __DICIONÁRIOS__

In [3]:
dados = {
    'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
    'acessos': [100, 200, 300, 400, 400],
    'site': ['site1', 'site2', 'site3', 'site4', np.nan],
    'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

Diferente da maioria das IDEs, o notebook retorna os valores de uma variável rodando ela simplesmente, sem precisar  da função print()

In [4]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 400],
 'site': ['site1', 'site2', 'site3', 'site4', nan],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

Um dicionário tem a seguinte __estrutura__:

* *.keys()*: são os __Títulos__ das colunas. No nosso dicionário, são elas: canal_vendas, acessos, site, vendas
* *.values()*: são os __Valores__ que as colunas carregam. No nosso dicionário, são as listas
* *.items()*: são os __CONJUNTOS__ de _keys_ e _values_. No nosso exemplo, 'acessos':[100, 200, 300, 400, 500] é um item

In [5]:
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [6]:
dados.values()  # este retorna uma LISTA de LISTAS

dict_values([['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'], [100, 200, 300, 400, 400], ['site1', 'site2', 'site3', 'site4', nan], [1000.52, 1052.34, 2002, 5000, 300]])

In [7]:
dados.items()  # este retorna uma LISTA de TUPLAS

dict_items([('canal_venda', ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']), ('acessos', [100, 200, 300, 400, 400]), ('site', ['site1', 'site2', 'site3', 'site4', nan]), ('vendas', [1000.52, 1052.34, 2002, 5000, 300])])

Podemos verificar o tipo de uma variável com o comando
```python
type(variável)
```

In [8]:
type(dados)

dict

In [9]:
type(dados['acessos'])

list

In [10]:
type(dados.items())

dict_items

Quando temos colunas, que seus _.values()_ são listas, podemos usar as propriedades de __slicing__
* [n]
* [:n]
* [n:]
* [-n]

In [11]:
dados['acessos'][0]

100

In [12]:
dados['acessos'][1:3]

[200, 300]

In [13]:
dados['acessos'][-1]

400

In [14]:
dados['acessos'][:3]

[100, 200, 300]

Também é importante saber manipular __LISTAS__, pois várias das _.keys()_ dos dicionários estão nesse formato. Uma lista nada mais é que uma variável composta que possui seus valores dentro de [ ] e são **indexados**
```python
[1, 'a', 3.5, 6, ...]
```

In [15]:
[1, 3, 'a', 4.5]

[1, 3, 'a', 4.5]

In [16]:
type([1, 2, 3])

list

Para adicionar novos conjuntos de valores a um dicionário
```python
dicionario['nova key'] = valor
```

In [17]:
dados['lista'] = [1, 2, 3, 4, 'a']

In [18]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 400],
 'site': ['site1', 'site2', 'site3', 'site4', nan],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [1, 2, 3, 4, 'a']}

Feitas tais considerações, podemos fazer o nosso primeiro __DataFrame__

In [19]:
pd.DataFrame?

In [20]:
dataframe = pd.DataFrame(dados)

In [21]:
dataframe

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2
2   instagram      300  site3  2002.00     3
3    linkedin      400  site4  5000.00     4
4    facebook      400    NaN   300.00     a

Quando um df é muito grande, ele não é impresso na integra, somente os valores iniciais e finais são mostrados. Mas é possível acessá-los separadamente com os comandos
```python
df.head(número_de_linhas)
df.tail(número_de_linhas)
```

In [22]:
dataframe.head(2)

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2

In [23]:
dataframe.tail(1)

  canal_venda  acessos site  vendas lista
4    facebook      400  NaN   300.0     a

Como maneira prática, podemos ver a "cara" do conjunto de dados usando o comando (@property)
```python
df.shape
```
ele retorna uma tupla que diz a quantidade de linhas e colunas do df, sendo (linha, coluna)

In [24]:
dataframe.shape

(5, 5)

Podemos ver também os Indices do df usando o método
```python
df.index
```

In [25]:
dataframe.index

RangeIndex(start=0, stop=5, step=1)

É possível ver também quais tipos primitivos os dados do df possuem
```python
df.dtypes
```

In [26]:
dataframe.dtypes  # porém não é tão confiável, pois na coluna "lista" 4 valores são int64 e 1 é object

canal_venda     object
acessos          int64
site            object
vendas         float64
lista           object
dtype: object

Podemos ver mais a fundo as características do df com o método
```python
df.info()
```

In [27]:
pd.DataFrame.info?

In [28]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         4 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

É possível também fazer um resumo das informações do seu df com o comando
```python
df.describe()
```
sendo esse resumo **Estatístico** alimentado apenas pelas colunas - *Series* - numéricas do df

In [29]:
dataframe.describe()

          acessos       vendas
count    5.000000     5.000000
mean   280.000000  1870.972000
std    130.384048  1850.931024
min    100.000000   300.000000
25%    200.000000  1000.520000
50%    300.000000  1052.340000
75%    400.000000  2002.000000
max    400.000000  5000.000000

Quando temos valores iguais numa coluna, não precisamos fazer um _for_ e implementar um contador para descobrir quantas vezes um mesmo valor aparece, basta usar o método
```python
Series.value_counts(normalize=True ou False, bins=int)
```
método este que te retorna nada menos que uma *Series* de **Frequências**, sendo os *.values* as frequências e os *.index* os valores únicos dessa *Series*

**Parâmetros:**
* normalize = retorna a **frequência relativa** de cada valor
* bins = retorna *int* **intervalos de classes**

**Nota:** caso vc faça intervalos de classes, os intervalos serão os *.index* dessa *Series*

In [30]:
pd.Series.value_counts?

In [31]:
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
linkedin     1
instagram    1
Name: canal_venda, dtype: int64

In [32]:
dataframe['canal_venda'].value_counts(normalize=True)

facebook     0.4
twitter      0.2
linkedin     0.2
instagram    0.2
Name: canal_venda, dtype: float64

In [33]:
dataframe['vendas'].value_counts(bins=3)

(295.29900000000004, 1866.667]    3
(3433.333, 5000.0]                1
(1866.667, 3433.333]              1
Name: vendas, dtype: int64

In [80]:
dataframe['vendas'].value_counts(normalize=True, bins=3)

(295.29900000000004, 1866.667]    0.6
(3433.333, 5000.0]                0.2
(1866.667, 3433.333]              0.2
Name: vendas, dtype: float64

In [88]:
print('tipo primitivo:', type(dataframe['vendas'].value_counts(normalize=True, bins=3)))
print(f'índices:', dataframe['vendas'].value_counts(normalize=True, bins=3).index)
print(f'valores:', dataframe['vendas'].value_counts(normalize=True, bins=3).values)

tipo primitivo: <class 'pandas.core.series.Series'>
índices: IntervalIndex([(295.29900000000004, 1866.667], (3433.333, 5000.0], (1866.667, 3433.333]],
              closed='right',
              dtype='interval[float64]')
valores: [0.6 0.2 0.2]

Em *Series* que seus valores são numéricos, podemos fugir das iterações para certas operações simples com os métodos
* Series.count() retorna o __Número__ de valores da coluna
* Series.sum(axis=0 ou 1) retorna a __Soma__ dos valores do eixo
* Series.max(axis=0 ou 1) retorna o valor __Máximo__ do eixo
* Series.min(axis=0 ou 1) retorna o valor __Mínimo__ do eixo
* Series.mean(axis=0 ou 1) retorna a __Média__ do eixo
* Series.median(axis=0 ou 1) retorna a __Mediana__ do eixo
* Series.mode() retorna a __Moda__
* Series.std(axis=0 ou 1) retorna o __Desvio Padrão__

In [35]:
dataframe['acessos'].sum()

1400

In [36]:
dataframe['acessos'].mode()  # embora mostre dois valores, o primeiro é um índice apenas

0    400
dtype: int64

Uma coisa que nos depararemos __MUITO__ é com dados faltantes, sejam eles _Nan_ ou _Nulls_. E para lidar com esse tipo de dado, usamos os métodos
* df.isna() retorna um valor booleano __True__ na posição do valor *NaN*, e **False** na posição que não é 
* df.isnull() retorna um valor booleano na  __True__ na posição do valor *Null*,e **False** na posição que nã é

In [37]:
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False   True   False  False

In [38]:
dataframe.isnull()  # embora não pareça, eles tem diferença

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False   True   False  False

Podemos unir dois métodos que já vimos para visualizar melhor a quantidade de *Nan* ou *Null* que podem existir num df, já que df muito grandes não se imprime todos os seus valores na tela. Podemos escolher uma coluna e
```python
Series.isna().value_counts()
```

In [39]:
dataframe['site'].isna()

0    False
1    False
2    False
3    False
4     True
Name: site, dtype: bool

In [40]:
dataframe['site'].isna().value_counts()

False    4
True     1
Name: site, dtype: int64

É possível adicionar novas colunas no df assim como um dicionário
```python
df['título'] = [lista de valores]
```

Da mesma forma que é possivel acessar valores tal qual um dicionário, embora existam maneiras muito mais eficientes
```python
df['Título'][formas de slicing]
```

In [41]:
dataframe['acessos'][:3]

0    100
1    200
2    300
Name: acessos, dtype: int64

In [42]:
dataframe['lista_2'] = [4, 5, 6, 7, 9]
dataframe

  canal_venda  acessos   site   vendas lista  lista_2
0    facebook      100  site1  1000.52     1        4
1     twitter      200  site2  1052.34     2        5
2   instagram      300  site3  2002.00     3        6
3    linkedin      400  site4  5000.00     4        7
4    facebook      400    NaN   300.00     a        9

Podemos consultar as colunas do df também
```python
df.columns
```

In [43]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'lista_2'], dtype='object')

Caso o df tenha muitas colunas, talvez nao revele todas elas dessa maneira, mas dessa revela
```python
df.columns.values
```

In [44]:
dataframe.columns.values

array(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'lista_2'],
      dtype=object)

Podemos modificar os títulos das colunas de um df de algumas maneiras, mas como os df geralmente são muito grandes e com muitas colunas, o melhor jeito é com o método
```python
df.rename(columns={'Título Atual': 'Título Novo', ...}, inplace=True ou False)
```
Lembrando que o parâmetro Inplace modifica o df em todas as suas requisições caso seu valor seja *True*

In [45]:
pd.DataFrame.rename?

In [46]:
dataframe.rename(columns={'canal_venda': 'plataforma_venda', 'acessos':'visualizações'})

  plataforma_venda  visualizações   site   vendas lista  lista_2
0         facebook            100  site1  1000.52     1        4
1          twitter            200  site2  1052.34     2        5
2        instagram            300  site3  2002.00     3        6
3         linkedin            400  site4  5000.00     4        7
4         facebook            400    NaN   300.00     a        9

Outra forma bem simples para mudar o título de um coluna
```python
Series.name = 'Título'
```

In [47]:
variavel = dataframe['vendas']
variavel.name = 'sellings'
variavel  # será útil quando entrarmos em join

0    1000.52
1    1052.34
2    2002.00
3    5000.00
4     300.00
Name: sellings, dtype: float64

Outro método que serve pra tudo que é _string_ é o
```python
str.replace('caracter ou string antiga', 'caracter ou string nova')
str.replace({'string antiga': 'string nova', 'string antiga': 'string nova', ...})
```

In [89]:
pd.Series.str.replace?

In [49]:
dataframe.columns.str.replace('_', ' ')  # dataframe.columns = dataframe.columns.str.replace('_', ' ')

Index(['canal venda', 'acessos', 'site', 'vendas', 'lista', 'lista 2'], dtype='object')

In [50]:
a = dataframe.copy()

In [51]:
a.columns = a.columns.str.replace('_', ' ')
a

  canal venda  acessos   site   vendas lista  lista 2
0    facebook      100  site1  1000.52     1        4
1     twitter      200  site2  1052.34     2        5
2   instagram      300  site3  2002.00     3        6
3    linkedin      400  site4  5000.00     4        7
4    facebook      400    NaN   300.00     a        9

Para __EXCLUIR__ colunas de um df
```python
df.drop(columns=['Título', 'Título', ...], inplace=True ou False)
df.drop(columns='Título', inplace=True ou False)
```

In [52]:
dataframe.drop(columns='lista_2')

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2
2   instagram      300  site3  2002.00     3
3    linkedin      400  site4  5000.00     4
4    facebook      400    NaN   300.00     a

In [53]:
dataframe.drop(columns=['lista', 'lista_2'])

  canal_venda  acessos   site   vendas
0    facebook      100  site1  1000.52
1     twitter      200  site2  1052.34
2   instagram      300  site3  2002.00
3    linkedin      400  site4  5000.00
4    facebook      400    NaN   300.00

**Nunca coloque um código de um cientista de dados em produção kkkkkk**

Vimos que fazer **slicing** de *Series* é bem tranquilo, funciona igual listas. Mas, e para um *DataFrame* inteiro? Acredito que saber isso é tão relevante quanto o primeiro caso. Para tanto, temos os métodos
* .loc[] aceita índices numéricos e strings para linhas, e strings para colunas
* .iloc[] aceita apenas índices numéricos tanto para linhas quanto colunas
e a sintaxe deles funciona de maneira muito similar
```python
df.loc[]
df.iloc[]
```
O que vai dentro das chaves também não muda muito
* .iloc[]
    * [indice_linha]
    
    * [indice_linha, indice_coluna]
    
    * [[indice_linha, indice_linha], indice_coluna]
    
    * [[indice_linha, indice_linha], [indice_coluna, indice_coluna]]
    
    * [indice_linha, [indice_coluna, indice_coluna]]
    
    * [indice_linha_i:indice_linha_f, indice_coluna]
    
    * [indice_linha, indice_coluna_i:indice_coluna_f]
    
    * [indice_linha_i:indice_linha_f, indice_coluna_i:indice_coluna_f]


* .loc[]
    
    * [indice_linha]
    
    * [indice_linha, 'titulo_coluna']
    
    * [[indice_linha, indice_linha], 'titulo_coluna']
    
    * [[indice_linha, indice_linha], ['titulo_coluna', 'titulo_coluna']]
    
    * [indice_linha, ['titulo_coluna', 'titulo_coluna']]
    
    * [indice_linha_i:indice_linha_f, 'titulo_coluna']
    
    * [indice_linha, 'titulo_coluna_i':'titulo_coluna_f']
    
    * [indice_linha_i:indice_linha_f, 'titulo_coluna_i':'titulo_coluna_f']

**Lembre**: o *indice_linha* do **.loc[]** pode ser tanto **número** quanto **string**

**Lembre 2**: Não esqueça que índices tipo *String* podem **MUDAR**, ou serem **EXCLUIDOS**. Ter algo em produção que use índices numéricos, pode ser mais vantajoso

In [54]:
dataframe.iloc[0]

canal_venda    facebook
acessos             100
site              site1
vendas          1000.52
lista                 1
lista_2               4
Name: 0, dtype: object

In [55]:
dataframe.iloc[:, 0]

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [56]:
dataframe.loc[[0, 3], 'vendas']

0    1000.52
3    5000.00
Name: sellings, dtype: float64

In [57]:
dataframe.loc[:3, ['vendas', 'acessos']]

    vendas  acessos
0  1000.52      100
1  1052.34      200
2  2002.00      300
3  5000.00      400

In [58]:
dataframe.loc[[0,3], 'acessos':'vendas']

   acessos   site   vendas
0      100  site1  1000.52
3      400  site4  5000.00

Tal qual o Excel, é possível fazer **Tabelas Dinâmicas** com pandas, não tão dinamica assim mas a idéia é boa
```python
df.pivot(index='Título', columns='Título', values=['Título 1', 'Título 2'])
```
**Parâmetros:**
* index = coluna que será usada pra fazer os índices da tabela com os seus valores
* columns = coluna que será usada pra fazer as colunas da tabela com os seus valores
* values = coluna que preencherá a tabela com seus valores, seguindo o pedido pelos índices e colunas

In [59]:
dataframe.pivot(index='canal_venda', columns='site', values='acessos')

site           NaN  site1  site2  site3  site4
canal_venda
facebook     400.0  100.0    NaN    NaN    NaN
instagram      NaN    NaN    NaN  300.0    NaN
linkedin       NaN    NaN    NaN    NaN  400.0
twitter        NaN    NaN  200.0    NaN    NaN

In [60]:
pd.pivot?

In [61]:
pd.melt?

Podemos **alterar** os índices de um df ou Series, e também resetar
```python
df.set_index('Título', inplace=True ou False)
df.reset_index(inplace=True ou False)
```
**Lembre:** para fazer isso, tem que ser um *Título* de valore **únicos**

In [62]:
dataframe.set_index('site')

      canal_venda  acessos   vendas lista  lista_2
site
site1    facebook      100  1000.52     1        4
site2     twitter      200  1052.34     2        5
site3   instagram      300  2002.00     3        6
site4    linkedin      400  5000.00     4        7
NaN      facebook      400   300.00     a        9

E para voltar os índices ao normal basta dar um reset
```python
df.reset_index(inplace=True ou False)
```

In [63]:
site_index = dataframe.set_index('site')
site_index

      canal_venda  acessos   vendas lista  lista_2
site
site1    facebook      100  1000.52     1        4
site2     twitter      200  1052.34     2        5
site3   instagram      300  2002.00     3        6
site4    linkedin      400  5000.00     4        7
NaN      facebook      400   300.00     a        9

In [64]:
site_index.reset_index()

    site canal_venda  acessos   vendas lista  lista_2
0  site1    facebook      100  1000.52     1        4
1  site2     twitter      200  1052.34     2        5
2  site3   instagram      300  2002.00     3        6
3  site4    linkedin      400  5000.00     4        7
4    NaN    facebook      400   300.00     a        9

Como vimos, sempre teremos *df* ou *Series* com dados faltantes, os famosos **NaN**. E para fazer aplicações de ML, devemos tratá-los, preenchendo com um valor conveniente o seu lugar. Para tanto
```python
df.fillna(value, inplace=True ou False, axis=0 ou 1)
df.dropna(subset=['Título', 'Título'], thrash=int, how='any' ou 'all', axis=0 ou 1, inplace=True ou False)
```
**Parâmetros**
* how = exclui a linha se 1 valor da linha for NaN:'any', se todos valores da linha forem NaN:'all'
* thresh = mantém o eixo com apenas *int* não NaN
* subset = colunas que o *.dropna()* vai olhar se tem NaN

In [65]:
pd.DataFrame.dropna?

In [66]:
dataframe['site'].fillna('site5')

0    site1
1    site2
2    site3
3    site4
4    site5
Name: site, dtype: object

In [67]:
dataframe.dropna()

  canal_venda  acessos   site   vendas lista  lista_2
0    facebook      100  site1  1000.52     1        4
1     twitter      200  site2  1052.34     2        5
2   instagram      300  site3  2002.00     3        6
3    linkedin      400  site4  5000.00     4        7

Novamente, para descobrimos quais valores únicos, e o número de valores únicos num *df* ou *Series*, nao iterarmos no conjunto de dados, podemos usar
```python
Series.unique()
Series.nunique()
df.nunique()
```

In [68]:
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [69]:
dataframe['canal_venda'].nunique()

4

In [70]:
dataframe.nunique()

canal_venda    4
acessos        4
site           4
vendas         5
lista          5
lista_2        5
dtype: int64

Uma das coisas que nos deparamos na estatístca é o **Coeficiente de Correlação**, que nos dá um valor de -1 a 1 de quão bem uma variável explica a outra. E para termos essa medida
```python
df.corr(method='pearson', 'kendall', 'spearman')
```

In [71]:
pd.DataFrame.corr?

In [72]:
dataframe.corr()

          acessos    vendas   lista_2
acessos  1.000000  0.426549  0.917070
vendas   0.426549  1.000000  0.068508
lista_2  0.917070  0.068508  1.000000

Vimos que podemos fazer **intervalos de classes** com o método *.count_values()*, mas tem como fazer com um método próprio pra isso. Ele faz a **Classificação** de cada índice da *Series* do *df* analisado, e retorna uma outra *Series* de **intervalos de classes**
```python
pd.cut(x = Series, bins=(limites dos intervalos), labels=('0 - 100', '100 - 200', ...))
```
**Nota:** fazer intervalos de classes é uma maneira de dar um *rótulo* à uma variável, e na estatística esse *label* chama-se **Variável Categórica**. Ou seja, criamos elas a partir de **Variáveis Numéricas**

In [73]:
pd.cut?

In [74]:
pd.cut(x=dataframe['vendas'], bins=(0, 1500, 3000, 4500, 6000), labels=('0 - 1500', '1500 - 3000', '3000 - 4500', '4500 - 6000'))

0       0 - 1500
1       0 - 1500
2    1500 - 3000
3    4500 - 6000
4       0 - 1500
Name: sellings, dtype: category
Categories (4, object): [0 - 1500 < 1500 - 3000 < 3000 - 4500 < 4500 - 6000]

In [91]:
a = pd.cut(x=dataframe['vendas'], bins=(0, 1500, 3000, 4500, 6000), labels=('0 - 1500', '1500 - 3000', '3000 - 4500', '4500 - 6000'))
dataframe['Intervalo de Classes'] = a
dataframe

  canal_venda  acessos   site   vendas lista  lista_2 Intervalo de Classes
0    facebook      100  site1  1000.52     1        4             0 - 1500
1     twitter      200  site2  1052.34     2        5             0 - 1500
2   instagram      300  site3  2002.00     3        6          1500 - 3000
3    linkedin      400  site4  5000.00     4        7          4500 - 6000
4    facebook      400    NaN   300.00     a        9             0 - 1500

**Este espaço será destinado ao GROUBY**

Por fim, podemos **exportar** essa tabela para um documento
```python
df.to_csv(path_or_buf='~/atividades.csv', sep=',', decimal='.', index=True ou False, chunksize=int ou None)
```
**Parâmetros:**
* sep = caracter que separa os valores entre as colunas
* decimal = caracter que identifica o ponto flutuante
* index = booleano que determina se o arquivo terá uma coluna de índices ou não
* chuncksize = linhas para se escrever por vez

In [76]:
pd.DataFrame.to_csv?

In [77]:
dataframe.to_csv(path_or_buf='./semana_2.csv', sep=',', decimal='.', index=False)

Por último, mas não menos importante, podemos **ler** um arquivo
```python
pd.read_csv(filepath_or_buffer='~/atividade.csv', delimiter ou sep=',', decimal='.', index_col='Título', nrows=int ou None)
```
**Parâmetros:**
* filepath_or_buffer = caminho de arquivo ou https://
* delimiter ou sep = pode usar **sep** ou **delimiter**, são **SINÔNIMOS**
* decimal = vc já sabe
* index_col = Coluna de valores **únicos** que pode ser usada como índices das linhas
* nrows = números de linhas do arquivo que deseja ler

In [78]:
pd.read_csv?

In [79]:
get_dataframe = pd.read_csv('./semana_2.csv', sep=',', decimal='.', index_col='site', nrows=3)
get_dataframe

      canal_venda  acessos   vendas  lista  lista_2 Intervalo de Classes
site
site1    facebook      100  1000.52      1        4             0 - 1500
site2     twitter      200  1052.34      2        5             0 - 1500
site3   instagram      300  2002.00      3        6          1500 - 3000

**Imputar Dados**

Vimos lá em cima como imputar dados, os tipo NaN ou Null no caso. E esse assunto deve ser levado a sério pois pode contaminar um conjunto de dados caso sejam colocados valores que influenciem os valores **REAIS** de maneira muito drástica.

**Exemplo:** Estou trabalhando num projeto e o valor do diâmetro de um fio está faltando em determinadas linhas, por conhecimento de causa, seja porque foi eu quem medi ou outra pessoas sabe, eu posso preencher os faltantes com 1mm, que é o seu valor real.

Diante disso, caso **não exista a possibilidade de colocar o valor certo**, temos certas abordagens para preencher os faltantes, de maneira tal que não influencie nos valores reais.

In [94]:
df2 = pd.read_csv('~/projetos_python/aceleradev/Data-Science-Online/Semana 2/train.csv')
df2.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Por que usar sets de treino e não sets de produção?**

O aprendizado que o modelo tem no seu próprio **treino** é fruto de um ambiente *controlado*, cenário esse que se conhecem todos os possíveis valores, diferente do cenário de *produção*, onde o seu modelo deverá ser capaz de inferir coisas que aprendeu através de dados **DESCONHECIDOS**. Ou seja, uma base de dados que não fez parte do treinamento. Exemplo: Como saberemos a média de idade dos dados das pessoas que entram no ambiente de produção?

**NO TESTE SE REPLICAM AS INFORMAÇÕES QUE SE APRENDERAM NO TREINO**

In [105]:
nan_coluna = df2.isna().sum()
n_linhas = df2.shape[0]
percentual_nan_coluna = nan_coluna/n_linhas
percentual_nan_coluna

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [98]:
resumo = pd.DataFrame({'colunas': df2.columns, 'tipos primitivos': df2.dtypes, 'percentual valores faltantes': df2.isna().sum() / df2.shape[0]})
resumo

                 colunas tipos primitivos  percentual valores faltantes
PassengerId  PassengerId            int64                      0.000000
Survived        Survived            int64                      0.000000
Pclass            Pclass            int64                      0.000000
Name                Name           object                      0.000000
Sex                  Sex           object                      0.000000
Age                  Age          float64                      0.198653
SibSp              SibSp            int64                      0.000000
Parch              Parch            int64                      0.000000
Ticket            Ticket           object                      0.000000
Fare                Fare          float64                      0.000000
Cabin              Cabin           object                      0.771044
Embarked        Embarked           object                      0.002245

**Nota 1:** Repare na coluna *Age*, seu tipo primitivo é um *float*. Geralmente, idade se apresenta no conjunto dos **inteiros**. Então, vale a pena ver como está essa *Serie*

**Nota 2:** Perceba que as únicas colunas com valores faltantes são: **Embarked, Cabin, Age**

**NOTA 3:** *Cabin* possui 77% de dados faltantes, vale a pena tratar esse dado? Devemos ver a real relevancia dela para o nosso problema, para que possaamos tomar a decisão de pensar *como preencher os seus dados* ou simplesmente descartar essa informação

In [106]:
df2['Age'].sample(8)

484    25.0
98     34.0
737    35.0
459     NaN
709     NaN
834    18.0
279    35.0
109     NaN
Name: Age, dtype: float64

percebemos que é do tipo *float* apenas porque existe um ponto flutuante depois do valor da idade, mas é apenas um *.0*

e já vamos preencher os seus *missing values*. No caso, vamos fazer isso com a **Média** da própria coluna, uma vez que não temos informações prévias sobre as idades faltantes. Nós poderíamos preencher esse valor com **Mediana, Moda, Zeros**, mas no exercício do prof ele escolheu a média

In [108]:
idade_media = df2['Age'].mean()
df2['Age'].fillna(idade_media, inplace=True)

Quando os dados são **Categóricos**, como é o caso de *Embarked* e *Cabin*, podemos preencher com **Unknown**

In [109]:
df2['Cabin'].fillna('Unknown', inplace=True)

**CONCLUSÃO:** Estude bem o set para tomar a melhor decisão em como preencher dados faltantes